题目描述
有这样一道智力题:“某商店规定:三个空汽水瓶可以换一瓶汽水。
小张手上有十个空汽水瓶,她最多可以换多少瓶汽水喝?答案是5
瓶,方法如下:先用9个空瓶子换3瓶汽水,喝掉3瓶满的,喝完以
后4个空瓶子,用3个再换一瓶,喝掉这瓶满的,这时候剩2个空瓶
子。然后你让老板先借给你一瓶汽水,喝掉这瓶满的,喝完以后用
3个空瓶子换一瓶满的还给老板。如果小张手上有n个空汽水瓶,最
多可以换多少瓶汽水喝?

#include<iostream>
using namespace std;

int main()
{
    int n;
    while(cin >> n)
    {
        int tmp = 0;
        int count = 0;
        while(n >= 2)
        {
            if(n == 2)//如果是两瓶，可以向老板借一瓶，所以数量在加一
            {
                count++;
                break;
            }
            tmp = n / 3;//换来的汽水
            n = n % 3 + tmp;//空瓶子的数量
            count += tmp;
        }
        
        cout << count << endl;
    }
    return 0;
}